app/views/messages/_message.html.erb

UPDATE "messages" SET "seen" = '1' WHERE "messages"."id" = 24
---
  <% if message.recipient.to_s == @current_user.id.to_s %>
 	<% message.update_columns(:seen =>"1") %>

INSERT INTO "messages" ("body", "conversation_id", "created_at", "recipient", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", "hi"], ["conversation_id", 2], ["created_at", "2015-01-27 13:39:33.537469"], ["recipient", 3], ["updated_at", "2015-01-27 13:39:33.537469"], ["user_id", 1]]
---
    <p><%= message.body %></p>
    <time datetime="<%= message.created_at %>" title="<%= message.created_at.strftime("%d %b  %Y at %I:%M%p") %>">