app/views/users/index.html.erb

SELECT  "messages".* FROM "messages"  WHERE "messages"."conversation_id" = ?  ORDER BY "messages"."id" DESC LIMIT 1  [["conversation_id", 1]]
---
            <%= link_to "", conversation_path(conversation), class: "conversation", "data-cid" => conversation.id %>
            <% if conversation_interlocutor(conversation) and conversation.messages.last != nil %>