app/controllers/messages_controller.rb

SELECT  "conversations".* FROM "conversations"  WHERE "conversations"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "messages" ("body", "conversation_id", "created_at", "recipient", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", "hi"], ["conversation_id", 2], ["created_at", "2015-01-27 13:39:33.537469"], ["recipient", 3], ["updated_at", "2015-01-27 13:39:33.537469"], ["user_id", 1]]
---
  def create
    @conversation = Conversation.find(params[:conversation_id])
    @message = @conversation.messages.build(message_params)
    @message.user_id = current_user.id
    @message.recipient = interlocutor(@conversation).id.to_s
    @message.save!